apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
/**************************************************************************//**
 * @file      rtl8710c_gpio_type.h
 * @brief
 * @version   V1.00
 * @date      2018-1-4 15:41:31
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_GPIO_TYPE_H_
#define _RTL8710C_GPIO_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_GPIO_REG_TYPE

/**
 * @addtogroup hs_hal_gpio_reg GPIO Registers.
 * @ingroup hs_hal_gpio
 * @{
 */

/**
  \brief Union type to access gpio_it_sts (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) GPIO interrupt type status Register                        */
  
  struct {
    __IM  uint32_t gpio_it_sts : 16;          /*!< [15..0] For each bit: 0: the specific GPIO pin is configured
                                                   to edge sensitive interrupt mode 1: the specific GPIO pin
                                                   is configured to levle sensitive interrupt mode.                          */
  } b;                                        /*!< bit fields for gpio_it_sts */
} gpio_it_sts_t, *pgpio_it_sts_t;

/**
  \brief Union type to access gpio_ei_en (@ 0x00000004).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000004) GPIO edge sensitive interrupt mode enable                  */
  
  struct {
    __IOM uint32_t ei_en      : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO pin is configured as edge sensitive interrupt mode
                                                   and also cause the corresponging bit of REG_GPIO_IT_STS
                                                   to be read as zero.                                                       */
  } b;                                        /*!< bit fields for gpio_ei_en */
} gpio_ei_en_t, *pgpio_ei_en_t;

/**
  \brief Union type to access gpio_li_en (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000008) GPIO level sensitive interrupt mode enable                 */
  
  struct {
    __IOM uint32_t li_en      : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO pin is configured as level sensitive interrupt mode
                                                   and also cause the corresponging bit of REG_GPIO_IT_STS
                                                   to be read as 1.                                                          */
  } b;                                        /*!< bit fields for gpio_li_en */
} gpio_li_en_t, *pgpio_li_en_t;

/**
  \brief Union type to access gpio_ip_sts (@ 0x0000000C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000000C) GPIO interrupt polarity status                             */
  
  struct {
    __IM  uint32_t ip_sts0    : 2;            /*!< [1..0] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts1    : 2;            /*!< [3..2] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts2    : 2;            /*!< [5..4] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts3    : 2;            /*!< [7..6] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts4    : 2;            /*!< [9..8] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts5    : 2;            /*!< [11..10] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts6    : 2;            /*!< [13..12] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts7    : 2;            /*!< [15..14] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts8    : 2;            /*!< [17..16] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts9    : 2;            /*!< [19..18] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts10   : 2;            /*!< [21..20] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts11   : 2;            /*!< [23..22] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts12   : 2;            /*!< [25..24] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts13   : 2;            /*!< [27..26] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts14   : 2;            /*!< [29..28] 00: the specific GPIO pin is configured as rising-edge
                                                   (active-high sensitive) 01: the specific GPIO pin is configured
                                                   as falling-edge (active-low sensitive) 10: the specific
                                                   GPIO pin is configured as dual-edge 11: reserved                          */
    __IM  uint32_t ip_sts15   : 2;            /*!< [31..30] The interrupt polarity status of GPIO15                          */
  } b;                                        /*!< bit fields for gpio_ip_sts */
} gpio_ip_sts_t, *pgpio_ip_sts_t;

/**
  \brief Union type to access gpio_ir_en (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) GPIO interrupt rising-edge enable                          */
  
