apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IOM uint32_t ir_en      : 16;           /*!< [15..0] For each bit write: 0: No operation; 1: the conrtolled
                                                   GPIO pin is configured to rising-edge interrupt mode or
                                                   high-level mode (depends on REG_GPIO_IT_STS) and also cause
                                                   the corresponding bits of REG_GPIO_IP_STS to be read as
                                                   00b.                                                                      */
  } b;                                        /*!< bit fields for gpio_ir_en */
} gpio_ir_en_t, *pgpio_ir_en_t;

/**
  \brief Union type to access gpio_if_en (@ 0x00000018).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000018) GPIO interrupt falling-edge enable                         */
  
  struct {
    __IOM uint32_t if_en      : 16;           /*!< [15..0] For each bit write: 0: No operation; 1: the conrtolled
                                                   GPIO pin is configured to falling-edge interrupt mode or
                                                   low-level interrupt mode (depends on REG_GPIO_IT_STS) and
                                                   cause the corresponding bits of REG_GPIO_IP_STS to be read
                                                   as 01b.                                                                   */
  } b;                                        /*!< bit fields for gpio_if_en */
} gpio_if_en_t, *pgpio_if_en_t;

/**
  \brief Union type to access gpio_id_en (@ 0x0000001C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000001C) GPIO interrupt dual-edge enable                            */
  
  struct {
    __IOM uint32_t id_en      : 16;           /*!< [15..0] For each bit write: 0: No operation; 1: the conrtolled
                                                   GPIO pin is configured to dual-edge interrupt mode and
                                                   also cause the corresponding bits of REG_GPIO_IP_STS to
                                                   be read as 10b.                                                           */
  } b;                                        /*!< bit fields for gpio_id_en */
} gpio_id_en_t, *pgpio_id_en_t;

/**
  \brief Union type to access gpio_ie_sts (@ 0x00000020).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000020) GPIO interrupt enable status                               */
  
  struct {
    __IM  uint32_t ie_sts     : 16;           /*!< [15..0] For each bit: 0: the interrupt of the specific GPIO
                                                   pin is disabled 1: the interrupt of the specific GPIO pin
                                                   is enabled                                                                */
  } b;                                        /*!< bit fields for gpio_ie_sts */
} gpio_ie_sts_t, *pgpio_ie_sts_t;

/**
  \brief Union type to access gpio_int_en (@ 0x00000024).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000024) GPIO interrupt enable                                      */
  
  struct {
    __IOM uint32_t int_en     : 16;           /*!< [15..0] For each bit write: 0: No operation 1: to enable the
                                                   specific GPIO INT and also cause the specified bit of REG_GPIO_IE_STS
                                                   to be read as ONE.                                                        */
  } b;                                        /*!< bit fields for gpio_int_en */
} gpio_int_en_t, *pgpio_int_en_t;

/**
  \brief Union type to access gpio_int_dis (@ 0x00000028).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000028) GPIO interrupt disable                                     */
  
  struct {
    __IOM uint32_t int_dis    : 16;           /*!< [15..0] For each bit write: 0: No operation 1: to disable the
                                                   specified GPIO INT and also cause the specified bit of
                                                   REG_GPIO_IE_STS to be read as ZERO.                                       */
  } b;                                        /*!< bit fields for gpio_int_dis */
} gpio_int_dis_t, *pgpio_int_dis_t;

/**
  \brief Union type to access gpio_int_raw_sts (@ 0x0000002C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000002C) GPIO RAW interrupt status                                  */
  
  struct {
    __IM  uint32_t int_raw_sts : 16;          /*!< [15..0] For each bit: 0: the specified GPIO pin has no pending
                                                   interrupt 1: the specified GPIO pin's interrupt is pending
                                                   (permasking)                                                              */
  } b;                                        /*!< bit fields for gpio_int_raw_sts */
} gpio_int_raw_sts_t, *pgpio_int_raw_sts_t;

/**
  \brief Union type to access gpio_int_sts (@ 0x00000030).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000030) GPIO interrupt status                                      */
  
  struct {
    __IM  uint32_t int_sts    : 16;           /*!< [15..0] For each bit: 0: the specified GPIO pin has no pending
                                                   interrupt 1: the specified GPIO pin's interrupt is pending                */
  } b;                                        /*!< bit fields for gpio_int_sts */
} gpio_int_sts_t, *pgpio_int_sts_t;

/**
  \brief Union type to access gpio_int_clr (@ 0x00000034).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000034) GPIO interrupt status clear                                */
  
  struct {
    __IOM uint32_t int_clr    : 16;           /*!< [15..0] For each bit writting: 0: No operation; 1: Clear edge
                                                   type pending interrupt of the conrtolled GPIO pin and clear
                                                   the specified bits of REG_GPIO_INT_STS as ZERO                            */
  } b;                                        /*!< bit fields for gpio_int_clr */
} gpio_int_clr_t, *pgpio_int_clr_t;

/**
  \brief Union type to access gpio_int_func_en_sts (@ 0x00000038).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000038) GPIO interrupt function enable status                      */
  
