apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IM  uint32_t int_en_sts : 16;           /*!< [15..0] For each bit: 0: the specified GPIO INT is Disable 1:
                                                   the specified GPIO INT is Enable                                          */
  } b;                                        /*!< bit fields for gpio_int_func_en_sts */
} gpio_int_func_en_sts_t, *pgpio_int_func_en_sts_t;

/**
  \brief Union type to access gpio_int_func_en (@ 0x0000003C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000003C) GPIO interrupt function enable                             */
  
  struct {
    __IOM uint32_t int_en     : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the specified
                                                   GPIO INT is enabled and also cause the specified bit of
                                                   REG_GPIO_INT_FUNC_EN_STS to be read as ONE.                               */
  } b;                                        /*!< bit fields for gpio_int_func_en */
} gpio_int_func_en_t, *pgpio_int_func_en_t;

/**
  \brief Union type to access gpio_int_func_dis (@ 0x00000040).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000040) GPIO interrupt function disable                            */
  
  struct {
    __IOM uint32_t int_dis    : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the specified
                                                   GPIO INT is disabled and also cause the specified bit of
                                                   REG_GPIO_INT_FUNC_EN_STS to be read as ZERO.                              */
  } b;                                        /*!< bit fields for gpio_int_func_dis */
} gpio_int_func_dis_t, *pgpio_int_func_dis_t;

/**
  \brief Union type to access gpio_int0_sel (@ 0x00000050).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000050) GPIO INT0 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT0                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT0                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT0                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int0_sel */
} gpio_int0_sel_t, *pgpio_int0_sel_t;

/**
  \brief Union type to access gpio_int1_sel (@ 0x00000054).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000054) GPIO INT1 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT1                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT1                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT1                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int1_sel */
} gpio_int1_sel_t, *pgpio_int1_sel_t;

/**
  \brief Union type to access gpio_int2_sel (@ 0x00000058).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000058) GPIO INT2 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT2                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT2                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT2                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int2_sel */
} gpio_int2_sel_t, *pgpio_int2_sel_t;

/**
  \brief Union type to access gpio_int3_sel (@ 0x0000005C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000005C) GPIO INT3 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT3                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT3                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT3                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int3_sel */
} gpio_int3_sel_t, *pgpio_int3_sel_t;

/**
  \brief Union type to access gpio_int4_sel (@ 0x00000060).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000060) GPIO INT4 selection                                        */
  
