apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT4                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT4                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT4                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int4_sel */
} gpio_int4_sel_t, *pgpio_int4_sel_t;

/**
  \brief Union type to access gpio_int5_sel (@ 0x00000064).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000064) GPIO INT5 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT5                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT5                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT5                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int5_sel */
} gpio_int5_sel_t, *pgpio_int5_sel_t;

/**
  \brief Union type to access gpio_int6_sel (@ 0x00000068).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000068) GPIO INT6 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT6                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT6                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT6                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int6_sel */
} gpio_int6_sel_t, *pgpio_int6_sel_t;

/**
  \brief Union type to access gpio_int7_sel (@ 0x0000006C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000006C) GPIO INT7 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT7                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT7                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT7                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int7_sel */
} gpio_int7_sel_t, *pgpio_int7_sel_t;

/**
  \brief Union type to access gpio_int8_sel (@ 0x00000070).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000070) GPIO INT8 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT8                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT8                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT8                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int8_sel */
} gpio_int8_sel_t, *pgpio_int8_sel_t;

/**
  \brief Union type to access gpio_int9_sel (@ 0x00000074).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000074) GPIO INT9 selection                                        */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT9                      */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT9                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT9                    */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int9_sel */
} gpio_int9_sel_t, *pgpio_int9_sel_t;

/**
  \brief Union type to access gpio_int10_sel (@ 0x00000078).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000078) GPIO INT10 selection                                       */
  
