apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT10                     */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT10                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT10                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int10_sel */
} gpio_int10_sel_t, *pgpio_int10_sel_t;

/**
  \brief Union type to access gpio_int11_sel (@ 0x0000007C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000007C) GPIO INT11 selection                                       */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT11                     */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT11                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT11                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int11_sel */
} gpio_int11_sel_t, *pgpio_int11_sel_t;

/**
  \brief Union type to access gpio_int12_sel (@ 0x00000080).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000080) GPIO INT12 selection                                       */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT12                     */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT12                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT12                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int12_sel */
} gpio_int12_sel_t, *pgpio_int12_sel_t;

/**
  \brief Union type to access gpio_int13_sel (@ 0x00000084).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000084) GPIO INT13 selection                                       */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT13                     */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT13                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT13                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int13_sel */
} gpio_int13_sel_t, *pgpio_int13_sel_t;

/**
  \brief Union type to access gpio_int14_sel (@ 0x00000088).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000088) GPIO INT14 selection                                       */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT14                     */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT14                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT14                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int14_sel */
} gpio_int14_sel_t, *pgpio_int14_sel_t;

/**
  \brief Union type to access gpio_int15_sel (@ 0x0000008C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000008C) GPIO INT15 selection                                       */
  
  struct {
    __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT15                     */
    __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT15                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT15                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                   1: Using debounce output signal as interrupt signal source                */
  } b;                                        /*!< bit fields for gpio_int15_sel */
} gpio_int15_sel_t, *pgpio_int15_sel_t;

/**
  \brief Union type to access gpio_deb_sts (@ 0x000000F0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F0) GPIO port debounce status                                  */
  
