apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IM  uint32_t deb_sts    : 16;           /*!< [15..0] For each bit: 0: the specific GPIO debounce pin is DISABLE
                                                   debounce 1: the specific GPIO debounce pin is ENABLE debounce             */
  } b;                                        /*!< bit fields for gpio_deb_sts */
} gpio_deb_sts_t, *pgpio_deb_sts_t;

/**
  \brief Union type to access gpio_deb_en (@ 0x000000F4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F4) GPIO debounce pin enable                                   */
  
  struct {
    __IOM uint32_t deb_en     : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO de-bouncing pin is enabled and also cause the specified
                                                   bit of REG_GPIO_DEB_STS to be read as ONE.                                */
  } b;                                        /*!< bit fields for gpio_deb_en */
} gpio_deb_en_t, *pgpio_deb_en_t;

/**
  \brief Union type to access gpio_deb_dis (@ 0x000000F8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F8) GPIO debounce pin disable                                  */
  
  struct {
    __IOM uint32_t deb_dis    : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO de-bouncing pin is disabled and also cause the specified
                                                   bit of REG_GPIO_DEB_STS to be read as ZERO.                               */
  } b;                                        /*!< bit fields for gpio_deb_dis */
} gpio_deb_dis_t, *pgpio_deb_dis_t;

/**
  \brief Union type to access gpio_deb_dp_sts (@ 0x000000FC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000FC) GPIO debounce data pin status                              */
  
  struct {
    __IM  uint32_t deb_dp_sts : 16;           /*!< [15..0] For each bit reading: read the signal level of the specified
                                                   pin after de-bounce                                                       */
  } b;                                        /*!< bit fields for gpio_deb_dp_sts */
} gpio_deb_dp_sts_t, *pgpio_deb_dp_sts_t;

/**
  \brief Union type to access gpio_deb0_sel (@ 0x00000100).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000100) GPIO debounce0 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce0                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce0                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb0_sel */
} gpio_deb0_sel_t, *pgpio_deb0_sel_t;

/**
  \brief Union type to access gpio_deb1_sel (@ 0x00000104).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000104) GPIO debounce1 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce1                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce1                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb1_sel */
} gpio_deb1_sel_t, *pgpio_deb1_sel_t;

/**
  \brief Union type to access gpio_deb2_sel (@ 0x00000108).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000108) GPIO debounce2 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce2                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce2                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb2_sel */
} gpio_deb2_sel_t, *pgpio_deb2_sel_t;

/**
  \brief Union type to access gpio_deb3_sel (@ 0x0000010C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000010C) GPIO debounce3 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce3                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce3                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb3_sel */
} gpio_deb3_sel_t, *pgpio_deb3_sel_t;

/**
  \brief Union type to access gpio_deb4_sel (@ 0x00000110).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000110) GPIO debounce4 selection                                   */
  
