apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce4                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce4                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb4_sel */
} gpio_deb4_sel_t, *pgpio_deb4_sel_t;

/**
  \brief Union type to access gpio_deb5_sel (@ 0x00000114).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000114) GPIO debounce5 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce5                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce5                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb5_sel */
} gpio_deb5_sel_t, *pgpio_deb5_sel_t;

/**
  \brief Union type to access gpio_deb6_sel (@ 0x00000118).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000118) GPIO debounce6 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce6                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce6                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb6_sel */
} gpio_deb6_sel_t, *pgpio_deb6_sel_t;

/**
  \brief Union type to access gpio_deb7_sel (@ 0x0000011C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000011C) GPIO debounce7 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce7                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce7                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb7_sel */
} gpio_deb7_sel_t, *pgpio_deb7_sel_t;

/**
  \brief Union type to access gpio_deb8_sel (@ 0x00000120).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000120) GPIO debounce8 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce8                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce8                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb8_sel */
} gpio_deb8_sel_t, *pgpio_deb8_sel_t;

/**
  \brief Union type to access gpio_deb9_sel (@ 0x00000124).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000124) GPIO debounce9 selection                                   */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce9                      */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce9                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb9_sel */
} gpio_deb9_sel_t, *pgpio_deb9_sel_t;

/**
  \brief Union type to access gpio_deb10_sel (@ 0x00000128).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000128) GPIO debounce10 selection                                  */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce10                     */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce10                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb10_sel */
} gpio_deb10_sel_t, *pgpio_deb10_sel_t;

/**
  \brief Union type to access gpio_deb11_sel (@ 0x0000012C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000012C) GPIO debounce11 selection                                  */
  
