apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce11                     */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce11                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb11_sel */
} gpio_deb11_sel_t, *pgpio_deb11_sel_t;

/**
  \brief Union type to access gpio_deb12_sel (@ 0x00000130).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000130) GPIO debounce12 selection                                  */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce12                     */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce12                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb12_sel */
} gpio_deb12_sel_t, *pgpio_deb12_sel_t;

/**
  \brief Union type to access gpio_deb13_sel (@ 0x00000134).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000134) GPIO debounce13 selection                                  */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce13                     */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce13                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb13_sel */
} gpio_deb13_sel_t, *pgpio_deb13_sel_t;

/**
  \brief Union type to access gpio_deb14_sel (@ 0x00000138).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000138) GPIO debounce14 selection                                  */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce14                     */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce14                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb14_sel */
} gpio_deb14_sel_t, *pgpio_deb14_sel_t;

/**
  \brief Union type to access gpio_deb15_sel (@ 0x0000013C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000013C) GPIO debounce15 selection                                  */
  
  struct {
    __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce15                     */
    __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce15                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                   cycles given in this field.                                               */
  } b;                                        /*!< bit fields for gpio_deb15_sel */
} gpio_deb15_sel_t, *pgpio_deb15_sel_t;

/**
  \brief Union type to access gpio_port_a_dmd_sts (@ 0x00000200).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000200) GPIO port A data mode direction status                     */
  
  struct {
    __IM  uint32_t dmd_sts    : 32;           /*!< [31..0] For each bit: 0: the specific GPIO pin is configured
                                                   to INPUT data mode 1: the specific GPIO pin is configured
                                                   to OUTPUT data mode                                                       */
  } b;                                        /*!< bit fields for gpio_port_a_dmd_sts */
} gpio_port_a_dmd_sts_t, *pgpio_port_a_dmd_sts_t;

/**
  \brief Union type to access gpio_port_a_idm_en (@ 0x00000204).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000204) GPIO port A input data mode enable                         */
  
  struct {
    __IOM uint32_t idm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                   GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                   to input data mode and also cause the specified bit of
                                                   REG_PORT_A_DMD_STS to be read as zero.                                    */
  } b;                                        /*!< bit fields for gpio_port_a_idm_en */
} gpio_port_a_idm_en_t, *pgpio_port_a_idm_en_t;

/**
  \brief Union type to access gpio_port_a_odm_en (@ 0x00000208).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000208) GPIO port A output data mode enable                        */
  
  struct {
    __IOM uint32_t odm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of conrtolled
                                                   GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                   as output data mode and also cause the specified bit of
                                                   REG_PORT_A_DMD_STS to be read as one                                      */
  } b;                                        /*!< bit fields for gpio_port_a_odm_en */
} gpio_port_a_odm_en_t, *pgpio_port_a_odm_en_t;

/**
  \brief Union type to access gpio_port_a_od_sts (@ 0x0000020C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000020C) GPIO port A output data status                             */
  
