apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IM  uint32_t od_sts     : 32;           /*!< [31..0] For each bit: 0: the specified GPIO pin is configured
                                                   as output low 1: the specified GPIO pin is configured as
                                                   output high , if the specific GPIO pin is output data mode.               */
  } b;                                        /*!< bit fields for gpio_port_c_od_sts */
} gpio_port_c_od_sts_t, *pgpio_port_c_od_sts_t;

/**
  \brief Union type to access gpio_port_c_odl_en (@ 0x00000290).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000290) GPIO port C output data low enable                         */
  
  struct {
    __IOM uint32_t odl_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO pin is configured as output low and also cause the
                                                   specified bit of REG_PORT_C_OD_STS is zero.                               */
  } b;                                        /*!< bit fields for gpio_port_c_odl_en */
} gpio_port_c_odl_en_t, *pgpio_port_c_odl_en_t;

/**
  \brief Union type to access gpio_port_c_odh_en (@ 0x00000294).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000294) GPIO port C output data high enable                        */
  
  struct {
    __IOM uint32_t odh_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO pin is configured as output high and also cause the
                                                   specified bit of REG_PORT_C_OD_STS is one.                                */
  } b;                                        /*!< bit fields for gpio_port_c_odh_en */
} gpio_port_c_odh_en_t, *pgpio_port_c_odh_en_t;

/**
  \brief Union type to access gpio_port_c_odt_en (@ 0x00000298).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000298) GPIO port C output data toggle enable                      */
  
  struct {
    __IOM uint32_t odt_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: Toggle output
                                                   of the conrtolled GPIO pin and the specified bit of REG_PORT_C_OD_STS
                                                   also will be toggled.                                                     */
  } b;                                        /*!< bit fields for gpio_port_c_odt_en */
} gpio_port_c_odt_en_t, *pgpio_port_c_odt_en_t;

/**
  \brief Union type to access gpio_port_c_dp_sts (@ 0x0000029C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000029C) GPIO port C data pin status                                */
  
  struct {
    __IM  uint32_t dp_sts     : 32;           /*!< [31..0] For each bit reading: If the direction of the specified
                                                   bit is input then read the signal level of the input pin.
                                                   If the direction of the specified bit is output then reads
                                                   the output data register for port C.                                      */
  } b;                                        /*!< bit fields for gpio_port_c_dp_sts */
} gpio_port_c_dp_sts_t, *pgpio_port_c_dp_sts_t;

/**
  \brief Union type to access gpio_port_d_dmd_sts (@ 0x000002C0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002C0) GPIO port D data mode direction status                     */
  
  struct {
    __IM  uint32_t dmd_sts    : 32;           /*!< [31..0] For each bit: 0: the specific GPIO pin is configured
                                                   to INPUT data mode 1: the specific GPIO pin is configured
                                                   to OUTPUT data mode                                                       */
  } b;                                        /*!< bit fields for gpio_port_d_dmd_sts */
} gpio_port_d_dmd_sts_t, *pgpio_port_d_dmd_sts_t;

/**
  \brief Union type to access gpio_port_d_idm_en (@ 0x000002C4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002C4) GPIO port D input data mode enable                         */
  
  struct {
    __IOM uint32_t idm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                   GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                   to input data mode and also cause the specified bit of
                                                   REG_PORT_D_DMD_STS to be read as zero.                                    */
  } b;                                        /*!< bit fields for gpio_port_d_idm_en */
} gpio_port_d_idm_en_t, *pgpio_port_d_idm_en_t;

/**
  \brief Union type to access gpio_port_d_odm_en (@ 0x000002C8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002C8) GPIO port D output data mode enable                        */
  
  struct {
    __IOM uint32_t odm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                   GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                   as output data mode and also cause the specified bit of
                                                   REG_PORT_D_DMD_STS to be read as one                                      */
  } b;                                        /*!< bit fields for gpio_port_d_odm_en */
} gpio_port_d_odm_en_t, *pgpio_port_d_odm_en_t;

/**
  \brief Union type to access gpio_port_d_od_sts (@ 0x000002CC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002CC) GPIO port D output data status                             */
  
