apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_gpio_type.h
  struct {
    __IM  uint32_t od_sts     : 32;           /*!< [31..0] For each bit: 0: the specified GPIO pin is configured
                                                   as output low 1: the specified GPIO pin is configured as
                                                   output high , if the specific GPIO pin is output data mode.               */
  } b;                                        /*!< bit fields for gpio_port_d_od_sts */
} gpio_port_d_od_sts_t, *pgpio_port_d_od_sts_t;

/**
  \brief Union type to access gpio_port_d_odl_en (@ 0x000002D0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002D0) GPIO port D output data low enable                         */
  
  struct {
    __IOM uint32_t odl_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO pin is configured as output low and also cause the
                                                   specified bit of REG_PORT_D_OD_STS is zero.                               */
  } b;                                        /*!< bit fields for gpio_port_d_odl_en */
} gpio_port_d_odl_en_t, *pgpio_port_d_odl_en_t;

/**
  \brief Union type to access gpio_port_d_odh_en (@ 0x000002D4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002D4) GPIO port D output data high enable                        */
  
  struct {
    __IOM uint32_t odh_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                   GPIO pin is configured as output high and also cause the
                                                   specified bit of REG_PORT_D_OD_STS is one.                                */
  } b;                                        /*!< bit fields for gpio_port_d_odh_en */
} gpio_port_d_odh_en_t, *pgpio_port_d_odh_en_t;

/**
  \brief Union type to access gpio_port_d_odt_en (@ 0x000002D8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002D8) GPIO port D output data toggle enable                      */
  
  struct {
    __IOM uint32_t odt_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: Toggle output
                                                   of the conrtolled GPIO pin and the specified bit of REG_PORT_D_OD_STS
                                                   also will be toggled.                                                     */
  } b;                                        /*!< bit fields for gpio_port_d_odt_en */
} gpio_port_d_odt_en_t, *pgpio_port_d_odt_en_t;

/**
  \brief Union type to access gpio_port_d_dp_sts (@ 0x000002DC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000002DC) GPIO port D data pin status                                */
  
  struct {
    __IM  uint32_t dp_sts     : 32;           /*!< [31..0] For each bit reading: If the direction of the specified
                                                   bit is input then read the signal level of the input pin.
                                                   If the direction of the specified bit is output then reads
                                                   the output data register for port D.                                      */
  } b;                                        /*!< bit fields for gpio_port_d_dp_sts */
} gpio_port_d_dp_sts_t, *pgpio_port_d_dp_sts_t;

/** @} */ /* End of group ls_hal_gpio_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_GPIO_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_GPIO_TYPE_H_

